#!/usr/bin/python3

# -*- coding: utf-8 -*-

"""
Алгоритм Прима (ближайшего соседа): действует аналогично алгоритму Краскала
(c) selfedu
"""

import math

from math import inf as INF

from Prima_algorythm.get_min import get_min

# список рёбер графа (длина, вершина 1, вершина 2)
R = [
    (INF, -1, -1), (13, 1, 2), (18, 1, 3), (17, 1, 4),
    (14, 1, 5), (22, 1, 6), (26, 2, 3), (19, 2, 5),
    (30, 3, 4), (22, 4, 6)
]

N = 6  # число вершин в графе
U = {1}  # множество соединённых вершин
T = []  # список рёбер остова
