# -*- coding: utf-8 -*-

"""
Алгоритм Форда-Фалкерсона позволяет определить максимальную пропускную способность потока в направленном графе
(с) selfedu
"""

from math import inf as INF
from Ford_Fulkerson.get_max_vertex import get_max_vertex
from Ford_Fulkerson.get_max_flow import get_max_flow
from Ford_Fulkerson.update_V import updateV

# конфигурация графа
V = [[[0, 0, 1], [20, 0, 1], [30, 0, 1], [10, 0, 1], [0, 0, 1]],
     [[20, 0, -1], [0, 0, 1], [40, 0, 1], [0, 0, 1], [30, 0, 1]],
     [[30, 0, -1], [40, 0, -1], [0, 0, 1], [10, 0, 1], [20, 0, 1]],
     [[10, 0, -1], [0, 0, 1], [10, 0, -1], [0, 0, 1], [20, 0, 1]],
     [[0, 0, 1], [30, 0, -1], [20, 0, -1], [20, 0, -1], [0, 0, 1]],
     ]

N = len(V) # число вершин в графе
init = 0 # вершина-исток (1-я)
end = 4 # вершина-сток (5-я)
Tinit = (INF, -1, init) # первый маршрут
f = [] # сюда будем класть максимальные потоки найденных маршрутов



